Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/c-api.tmx
Source language: en
Languages: pl

source: Convert a Python integer to a C :ctype:`unsigned long long` without overflow checking. This format is only available on platforms that support :ctype:`unsigned long long` (or :ctype:`unsigned _int64` on Windows).
pl: Przelicza liczbę całkowitą języka Python na liczbę całkowitą języka C typu :ctype:`unsigned long long` bez sprawdzania czy nie przekroczono zakresu wartości. Ten format jest dostępny tylko w systemach, które wspierają liczby typu :ctype:`unsigned long long` (lub typu :ctype:`unsigned _int64` w systemie Windows).

source: Convert a Python integer to a C :ctype:`Py_ssize_t`.
pl: Przelicza liczbę całkowitą języka Python do wielkości rozmiaru :ctype:`Py_ssize_t` z języka C.

source: Convert a Python byte, represented as a :class:`bytes` object of length 1, to a C :ctype:`char`.
pl: Zamienia zawartość danej bajtowej z języka Python o typie byte, reprezentującej obiekt ciągu bajtów klasy :class:`bytes` o długości 1, na znak typu :ctype:`char` z języka C.

source: Convert a Python character, represented as a :class:`str` object of length 1, to a C :ctype:`int`.
pl: Przelicza wartość reprezentującą znak języka Python - obiekt klasy :class:`str` o długości 1, na liczbę całkowitą języka C typu :ctype:`int`.

source: Convert a Python floating point number to a C :ctype:`float`.
pl: Zamienia liczbę zmiennoprzecinkową języka Python na liczbę zmiennoprzecinkową typu :ctype:`float` języka C.

source: Convert a Python floating point number to a C :ctype:`double`.
pl: Zamienia liczbę zmiennoprzecinkową z języka Python na liczbę zmiennoprzecinkową podwójnej precyzji typu :ctype:`double` w języku C.

source: Convert a Python complex number to a C :ctype:`Py_complex` structure.
pl: Przekłada liczbę zespoloną języka Python do struktury liczby zespolonej języka C typu :ctype:`Py_complex`.

source: Other objects
pl: Inne obiekty

source: Store a Python object (without any conversion) in a C object pointer. The C program thus receives the actual object that was passed. The object's reference count is not increased. The pointer stored is not *NULL*.
pl: Zachowuje wskazanie na obiekt języka Python (bez wprowadzania żadnych zmian) do wskaźnika obiektowego języka C. Program w języku C otrzymuje w ten sposób konkretnie ten obiekt który został przekazany do funkcji. Liczba odniesień do obiektu nie zwiększa się. Zapamiętany wskaźnik jest niepusty (not *NULL*).

source: Store a Python object in a C object pointer. This is similar to ``O``, but takes two C arguments: the first is the address of a Python type object, the second is the address of the C variable (of type :ctype:`PyObject\*`) into which the object pointer is stored. If the Python object does not have the required type, :exc:`TypeError` is raised.
pl: Zachowuje obiekt języka Python we wskaźniku na obiekt z języka C. Jest podobna do ``O``, ale oczekuje dwóch argumentów: pierwszym jest adres obiektu typu języka Python, a drugim jest adres zmiennej języka C (o typie :ctype:`PyObject\*`) do którego zachowywany jest wskaźnik na obiekt. Jeśli obiekt języka Python nie posiada wymaganego typu, wyjątek :exc:`TypeError` jest zgłaszany.

source: Convert a Python object to a C variable through a *converter* function. This takes two arguments: the first is a function, the second is the address of a C variable (of arbitrary type), converted to :ctype:`void \*`. The *converter* function in turn is called as follows::
pl: Zamienia obiekt języka Python na zmienną języka C przy użyciu funkcji *konwertującej*. Oczekuje dwóch argumentów: pierwszym jest funkcja, a drugim jest adres zmiennej z języka C (o dowolnym typie), zamieniany do wskaźnika typu :ctype:`void\*`. Funkcja *konwertująca* z kolei jest wywoływana w sposób następujący::

source: status = converter(object, address);
pl: stan = konwerter(obiekt, adres);

source: where *object* is the Python object to be converted and *address* is the :ctype:`void\*` argument that was passed to the :cfunc:`PyArg_Parse\*` function. The returned *status* should be ``1`` for a successful conversion and ``0`` if the conversion has failed. When the conversion fails, the *converter* function should raise an exception and leave the content of *address* unmodified.
pl: Gdzie *obiekt* jest obiektem przeznaczonym do zamiany, a *adres* jest argumentem typu :ctype:`void\*`, który został przekazany do funkcji :cfunc:`PyArg_Parse\*`. Zwrócony *status* powinien być równy ``1`` dla udanej zamiany i ``0`` jeśli zamiana nie powiodła się. Gdy zamiana zawodzi, funkcja *konwertera* powinna zgłosić wyjątek i pozostawić zawartość pamięci spod *adresu* bez zmian.

source: If the *converter* returns Py_CLEANUP_SUPPORTED, it may get called a second time if the argument parsing eventually fails, giving the converter a chance to release any memory that it had already allocated. In this second call, the *object* parameter will be NULL; *address* will have the same value as in the original call.
pl: Jeśli *konwerter* zwraca status Py_CLEANUP_SUPPORTED, może zostać wywołany po raz drugi, jeśli wczytywanie argumentów ostatecznie zawiedzie, dając konwerterowi szansę na zwolnienie jakiejkolwiek pamięci, którą uprzednio przydzielił. W tym drugim wywołaniu, parametr *obiekt* będzie pusty (NULL); zaś *adres* będzie miał tą samą wartość, co przy pierwszym wywołaniu.

source: The object must be a Python sequence whose length is the number of format units in *items*. The C arguments must correspond to the individual format units in *items*. Format units for sequences may be nested.
pl: Obiekt musi być sekwencją języka Python, której długość jest liczbą elementów formatu mierzoną w *elementach*. Argumenty języka C muszą odpowiadać poszczególnym jednostkom formatu w *elementach*. Jednostki formatu dla sekwencji mogą być zagnieżdżane.

source: It is possible to pass "long" integers (integers whose value exceeds the platform's :const:`LONG_MAX`) however no proper range checking is done --- the most significant bits are silently truncated when the receiving field is too small to receive the value (actually, the semantics are inherited from downcasts in C --- your mileage may vary).
pl: Możliwe jest przekazywanie liczb całkowitych "długich" (liczb całkowitych, których wartość przekracza wartość stałej :const:`LONG_MAX` określoną dla danej architektury) chociaż żadne właściwe sprawdzenie zakresu nie jest wykonywane - najbardziej znaczące cyfry dwójkowe są w milczeniu obcinane, gdy docelowy obszar pamięci jest zbyt mały, aby przyjąć wartość (w rzeczywistości składnia jest odziedziczona po rzutowaniu z języka C --- twoje doświadczenia mogą się różnić).

source: A few other characters have a meaning in a format string. These may not occur inside nested parentheses. They are:
pl: Kilka innych znaków ma jeszcze znaczenie w ciągu formatu. Nie mogą one wystąpić wewnątrz zagnieżdżonych nawiasach okrągłych. Są to:

source: Indicates that the remaining arguments in the Python argument list are optional. The C variables corresponding to optional arguments should be initialized to their default value --- when an optional argument is not specified, :cfunc:`PyArg_ParseTuple` does not touch the contents of the corresponding C variable(s).
pl: Oznacza, że pozostałe argumenty z listy argumentów języka Python są dowolne. Zmiennym języka C odpowiadającym parametrom nadobowiązkowym powinny zostać przypisane wartości początkowe równe ich wartościom automatycznym --- gdy nadobowiązkowy parametr nie jest określony, funkcja :cfunc:`PyArg_ParseTuple` nie zmienia zawartości odpowiadającej zmiennej(ych) języka C.

source: The list of format units ends here; the string after the colon is used as the function name in error messages (the "associated value" of the exception that :cfunc:`PyArg_ParseTuple` raises).
pl: Lista jednostek formatu kończy się tutaj; Ciąg po dwukropku jest używany jako nazwa funkcji w wiadomościach o błędach ("załączona wartość" dla wyjątku, który zgłasza funkcja :cfunc:`PyArg_ParseTuple`).

source: The list of format units ends here; the string after the semicolon is used as the error message *instead* of the default error message. ``:`` and ``;`` mutually exclude each other.
pl: Na tym kończy się lista jednostek formatu; ciąg po średniku jest traktowany jako informacja o błędzie do użycia *zamiast* automatycznej wiadomości o błędzie. Znaki dwukropka ``:`` i średnika ``;`` wzajemnie się wykluczają.

source: Note that any Python object references which are provided to the caller are *borrowed* references; do not decrement their reference count!
pl: Zwróć uwagę, że każde odniesienie do obiektu Pythona które jest dostarczone do wywołującego funkcję jest odniesieniem *pożyczonym*; nie zmniejsza ich liczby odniesień!

source: Additional arguments passed to these functions must be addresses of variables whose type is determined by the format string; these are used to store values from the input tuple. There are a few cases, as described in the list of format units above, where these parameters are used as input values; they should match what is specified for the corresponding format unit in that case.
pl: Dodatkowe parametry przekazywane do tych funkcji muszą być adresami zmiennych których typ jest określany przez ciąg formatu; są one używane do przechowywania wartości z krotki wejściowej. Jest parę przypadków, jak opisuje to lista jednostek formatu powyżej, gdzie te parametry są używane jako wprowadzane wartości; w takich przypadku powinny one odpowiadać temu, co jest określone we właściwych im jednostach formatu.

source: For the conversion to succeed, the *arg* object must match the format and the format must be exhausted. On success, the :cfunc:`PyArg_Parse\*` functions return true, otherwise they return false and raise an appropriate exception. When the :cfunc:`PyArg_Parse\*` functions fail due to conversion failure in one of the format units, the variables at the addresses corresponding to that and the following format units are left untouched.
pl: Aby zamiana się powiodła, obiekt argumentu *arg* musi odpowiadać formatowi i format musi zostać wyczerpany. W przypadku powodzenia operacji funkcje :cfunc:`PyArg_Parse\*` zwracają wartość prawdy, w przeciwnym przypadku zwracają fałsz i zgłaszają właściwy wyjątek. Gdy funkcje :cfunc:`PyArg_Parse\*` zawiodą z powodu niepowodzenia konwersji w jednej z jednostek formatu, zmienne pod adresami odpowiadającymi temu i następnym jednostkom formatu są pozostawiane nietknięte.

source: API Functions
pl: Funkcje interfejsu programowania aplikacji

source: Building values
pl: Budowanie wartości

source: Boolean Objects
pl: Obiekty logiki Boole'a

source: Booleans in Python are implemented as a subclass of integers. There are only two booleans, :const:`Py_False` and :const:`Py_True`. As such, the normal creation and deletion functions don't apply to booleans. The following macros are available, however.
pl: zmienne logiczne w języku Python są wykonane jako podklasa liczb całkowitych. Są tylko dwie wartości Boolowskie, stała oznaczająca wartość fałszu - :const:`Py_False` i stała oznaczająca wartość prawdy - :const:`Py_True`. Jako takie, normalne funkcje tworzące i usuwające nie dotyczą zmiennych logicznych. Dostępne są jednak następujące makropolecenia.

source: Buffer Objects
pl: Obiekty buforów

source: Python objects implemented in C can export a "buffer interface." These functions can be used by an object to expose its data in a raw, byte-oriented format. Clients of the object can use the buffer interface to access the object data directly, without needing to copy it first.
pl: Przedmioty języka pyton urzeczywistnione w języku C mogą uzewnętrzniać "postać skrzynki wymiany". Te zadania mogą być wykonane przez przedmiot do odsłaniania swoich zapisów w nieprzetworzonej postaci zobrazowanej w równej wielkości kęsach. Używający przedmiotu mogą skorzystać z postaci skrzynki wymiany aby uzyskać dostęp do zapisów przedmiotu bezpośrednio, bez konieczności uprzedniego sporządzania odwzorowania przedmiotu.

source: Two examples of objects that support the buffer interface are bytes and arrays. The bytes object exposes the character contents in the buffer interface's byte-oriented form. An array can also expose its contents, but it should be noted that array elements may be multi-byte values.
pl: Dwoma przykładami przedmiotów, które wspierają sprzęg wczytywania z wyprzedzeniem są zestawy kęsowe i tabele. Przedmiot zestawu kęsowego uzewnętrznia zawartość znakową w postaci zorientowanego kęsowo zawartej w sprzęgu wczytywania z wyprzedzeniem. Tabela może także uzewnętrzniać swoją zawartość, ale warto zauważyć, że elementami tabeli mogą być wartości wielokęsowe.

source: An example user of the buffer interface is the file object's :meth:`write` method. Any object that can export a series of bytes through the buffer interface can be written to a file. There are a number of format codes to :cfunc:`PyArg_ParseTuple` that operate against an object's buffer interface, returning data from the target object.
pl: Przykładem przypadku użycia sprzęgu wczytywania z wyprzedzeniem jest sposób postępowania zapisywania :meth:`write` przedmiotu plikowego. Każdy przedmiot, który może wydawać seryjnie kęsy przez sprzęg wczytywania z wyprzedzeniem może być zapisany do pliku. Jest kilka postaci kodujących dla zadania :cfunc:`PyArg_ParseTuple` które operują na sprzęgu wczytywania z wyprzedzeniem przedmiotu, zwracając dane z przedmiotu docelowego.

source: More information on the buffer interface is provided in the section :ref:`buffer-structs`, under the description for :ctype:`PyBufferProcs`.
pl: Więcej informacji o sprzęgu wczytywania z wyprzedzeniem w sekcji :ref:`struktury-bufora`, pod opisem dla :ctype:`PyBufferProcs`.

source: Buffer objects are useful as a way to expose the data from another object's buffer interface to the Python programmer. They can also be used as a zero-copy slicing mechanism. Using their ability to reference a block of memory, it is possible to expose any data to the Python programmer quite easily. The memory could be a large, constant array in a C extension, it could be a raw block of memory for manipulation before passing to an operating system library, or it could be used to pass around structured data in its native, in-memory format.
pl: przedmioty wczytywania z wyprzedzeniem są użyteczne jako sposób uzewnętrzniania danych ze sprzęgu wczytywania z wyprzedzeniem innego przedmiotu dla programującego w języku pytonowskim. Mogą także być użyte do mechanizmu operacji na ciągach cząstkowych bez kopiowania. Używając ich zdolności do odwołania się do obszaru pamięci, jest możliwe uzewnętrznienie dowolnych danych dla programującego w języku pytonowskim w całkiem łatwy sposób. Pamięć może mieć postać całkiem sporej stałej tabeli w rozszerzeniu języka C, może także być surowym obszarem pamięci dla operowania przed przekazaniem dla biblioteki systemu operacyjnego, lub może być używana dla wzajemnego przekazywania usystematyzowanych informacji w swojej naturalnej postaci wewnętrznej dla pamięci.

source: Buffer related functions
pl: Zadania związane z przedmiotem wczytywania z wyprzedzeniem.

source: MemoryView objects
pl: Przedmioty Widoku Pamięci

source: A memoryview object exposes the C level buffer interface to Python.
pl: Przedmiot widoku pamięci uzewnętrznia sprzęg wczytywania z wyprzedzeniem z poziomu języka C dla języka pytonowskiego.

source: Byte Array Objects
pl: Przedmioty Tabel Kęsowych

source: Type check macros
pl: Makra sprawdzające typ danych

source: Direct API functions
pl: Zadania Bezpośredniego API (sprzęgu programującego aplikację)

source: Macros
pl: Makropolecenia

source: These macros trade safety for speed and they don't check pointers.
pl: Te makropolecenia pomijają zabezpieczenia na korzyść zwiększenia szybkości działania i nie sprawdzają wskaźników.

source: Bytes Objects
pl: Przedmioty Kęsowe

source: These functions raise :exc:`TypeError` when expecting a bytes parameter and are called with a non-bytes parameter.
pl: Te zadania zgłaszają wyjątek :exc:`TypeError` gdy w oczekiwaniu na parametr kęsowy otrzymają nie-kęsowy parametr wejściowy.

source: Capsules
pl: Kapsuły

source: Refer to :ref:`using-capsules` for more information on using these objects.
pl: Zerknij do :ref:`używanie-kapsuł` po więcej informacji o używaniu tych przedmiotów.

source: Cell Objects
pl: Przedmioty Komórkowe.

source: "Cell" objects are used to implement variables referenced by multiple scopes. For each such variable, a cell object is created to store the value; the local variables of each stack frame that references the value contains a reference to the cells from outer scopes which also use that variable. When the value is accessed, the value contained in the cell is used instead of the cell object itself. This de-referencing of the cell object requires support from the generated byte-code; these are not automatically de-referenced when accessed. Cell objects are not likely to be useful elsewhere.
pl: "Komórkowe" przedmioty są używane do uszczegóławiania zmiennych, do których odwołania znajdują się w wielu zakresach. Dla każdej takiej zmiennej, przedmiot komórkowy jest tworzony aby przechowywać wartość; Zmienne lokalne dla każdej ramki stosu, która odwołuje się do wartości, zawiera odniesienie do komórek z zewnętrznych zakresów które także używają tych zmiennych. Gdy wartość jest odczytywana, wartość zawarta w komórce jest używana zamiast przedmiotu komórki samego w sobie. To wtórne odwołanie przedmiotu komórkowego wymaga wsparcia od wygenerowanego kodu-kęsowego; takie kody nie są automatycznie wtórnie odwoływane podczas dostępu. Przedmioty komórkowe nie są raczej użyteczne gdzie indziej.

source: Code Objects
pl: Przedmioty kodowe

source: Code objects are a low-level detail of the CPython implementation. Each one represents a chunk of executable code that hasn't yet been bound into a function.
pl: Przedmioty kodowe są niskopoziomowym detalem realizacji języka pytonowskiego - CPython. Każdy jeden reprezentuje fragment wykonywalnego kodu który nie został jeszcze związany z żadną funkcją.

source: Complex Number Objects
pl: Przedmioty Liczb Zespolonych

source: Python's complex number objects are implemented as two distinct types when viewed from the C API: one is the Python object exposed to Python programs, and the other is a C structure which represents the actual complex number value. The API provides functions for working with both.
pl: Przedmioty liczb zespolonych języka pytonowskiego są urzeczywistnione jako dwa różne typy patrząc z punktu widzenia sprzęgu programowania API języka C: jednym jest przedmiot wyprowadzony dla programów języka pytonowskiego, zaś drugi jest strukturą języka C która oddaje właściwą wartość liczby zespolonej. Sprzęg oprogramowania (API) dostarcza zadania do pracy z obydwoma typami.

source: Complex Numbers as C Structures
pl: Liczby zespolone jako struktury języka C.

source: Note that the functions which accept these structures as parameters and return them as results do so *by value* rather than dereferencing them through pointers. This is consistent throughout the API.
pl: Zauważ proszę że zadania które przyjmują te struktury w miejsce parametrów i zwracają je jako wyniki czynią to *przez wartość* zamiast odwoływać się do nich przez wskazania. Ta własność jest spójna w całym sprzęgu programowania (API).

source: Complex Numbers as Python Objects
pl: Liczby zespolone jako przedmioty języka pytonowskiego

source: Concrete Objects Layer
pl: Warstwa przedmiotów konkretnych

source: The functions in this chapter are specific to certain Python object types. Passing them an object of the wrong type is not a good idea; if you receive an object from a Python program and you are not sure that it has the right type, you must perform a type check first; for example, to check that an object is a dictionary, use :cfunc:`PyDict_Check`. The chapter is structured like the "family tree" of Python object types.
pl: Zadania w tym rozdziale są szczególne dla konkretnych typów przedmiotów języka pytonowskiego. Przekazywanie im przedmiotów niewłaściwego typu to nie dobry pomysł; jeśli otrzymujesz przedmiot z programy w języku pytonowskim i nie jesteś pewien czy jest on właściwego typu, musisz najpierw wykonać sprawdzenie typu; na przykład, aby sprawdzić czy przedmiot jest słownikiem, użyj zadania :cfunc:`PyDict_Check`. Rozdział jest podzielony jako "drzewo rodzinne" typów przedmiotów języka pytonowskiego.

source: While the functions described in this chapter carefully check the type of the objects which are passed in, many of them do not check for *NULL* being passed instead of a valid object. Allowing *NULL* to be passed in can cause memory access violations and immediate termination of the interpreter.
pl: Podczas gdy zadania opisane w tym rozdziale dokładnie sprawdzają rodzaj przedmiotów które zostaną im przekazane, wiele z nich nie jest odporna na przekazanie im wartości *NULL* zamiast właściwego przedmiotu. Pozwalając aby wartość *NULL* była przekazywana dla zadania może powodować naruszenia dostępu do pamięci i natychmiastowe zakończenie programu wykonującego program.

source: Fundamental Objects
pl: Przedmioty podstawowe

source: This section describes Python type objects and the singleton object ``None``.
pl: Ten rozdział opisuje przedmioty typów języka pytonowskiego i przedmiot prostacki ``Żaden`` (``None``).

source: Numeric Objects
pl: Przedmioty numeryczne

source: Sequence Objects
pl: Przedmioty sekwencji

source: Generic operations on sequence objects were discussed in the previous chapter; this section deals with the specific kinds of sequence objects that are intrinsic to the Python language.
pl: Podstawowe operacje na przedmiotach ciągłych zostały opisane w poprzednim rozdziale; ten rozdział zajmuje się szczególnymi rodzajami przedmiotów ciągłych które są wewnętrzne dla języka pytonowskiego.

source: Mapping Objects
pl: Przedmioty mapujące

source: Other Objects
pl: Inne przedmioty

source: String conversion and formatting
pl: Podstawienia i formatowanie ciągów znaków

source: Functions for number conversion and formatted string output.
pl: Zadanie dla zamiany liczb i wyjścia znakowego sformatowanego.

source: :cfunc:`PyOS_snprintf` and :cfunc:`PyOS_vsnprintf` wrap the Standard C library functions :cfunc:`snprintf` and :cfunc:`vsnprintf`. Their purpose is to guarantee consistent behavior in corner cases, which the Standard C functions do not.
pl: zadania :cfunc:`PyOS_snpritf` i :cfunc:`PyOS_vsnprintf` opakowują sztandarowe biblioteczne zadania języka C :cfunc:`snprintf` i :cfunc:`vsnprintf`. Ich celem jest zagwarantowanie spójnego zachowania w przypadkach brzegowych, których sztandarowe zadania języka C nie gwarantują.

source: The wrappers ensure that *str*[*size*-1] is always ``'\0'`` upon return. They never write more than *size* bytes (including the trailing ``'\0'``) into str. Both functions require that ``str != NULL``, ``size > 0`` and ``format != NULL``.
pl: Opakowania zapewniają że ostatni znak ciągu *str*[*size*-1] gdzie size - rozmiar ciągu zawsze zwraca ``'\0'``. Nigdy nie wypisują więcej niż *rozmiar ciągu* (*size*) kęsów (włącznie z kończącym znakiem zera ``'\0'``) do str. Obydwa zadania wymagają aby ``str != NULL``, ``size > 0 `` i ``format != NULL``.

source: If the platform doesn't have :cfunc:`vsnprintf` and the buffer size needed to avoid truncation exceeds *size* by more than 512 bytes, Python aborts with a *Py_FatalError*.
pl: Jeśli system nie posiada zadania :cfunc:`vsnprintf` i rozmiar wymiennika potrzebny aby uniknąć obcinania przekracza *rozmiar* (*size*) o więcej niż 512 kęsów, program wykonujący przerywany jest z komunikatem *Py_FatalError*.
